---
kind: method
id: M:Autodesk.Revit.DB.ExternalGeometryId.Equals(System.Object)
source: html/7c0a2348-a738-198b-3f12-78373cd34439.htm
---
# Autodesk.Revit.DB.ExternalGeometryId.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another object.